app/Controllers/Home.php

    public function index(): string
    {
        // Instantiate the model
        $serviceModel = new ServiceModel();
        $categoryModel = new ServiceCategoryModel();
        $merchantModel = new MerchantModel();
        $listingModel = new MerchantListingModel();
        $locationModel = new MerchantLocationModel();
        $services = $serviceModel->getHomepageServices(7);

        // Fetch approved and visible merchants
        $merchants = $merchantModel->where('verification_status', 'approved')->where('is_visible', 1)->findAll();

        if (!empty($merchants)) {
            $merchantIds = array_column($merchants, 'id');

            // Fetch all approved listings for these merchants in one go
            $allListings = $listingModel
                ->whereIn('merchant_id', $merchantIds)
                ->where('status', 'approved')
                ->findAll();
---
SELECT *
FROM `merchants`
WHERE `verification_status` = 'approved'
AND `is_visible` = 1
SELECT *
FROM `merchant_listings`
WHERE `merchant_id` IN ('21','22')
AND `status` = 'approved'