app/Models/AdminModel.php

SELECT *
FROM `admins`
WHERE `email` = 'admin@truckersafrica.com'
 LIMIT 1
---
    public function verifyPassword(string $email, string $password)
    {
        $admin = $this->where('email', $email)->first();