app/Models/ServiceCategoryModel.php

SELECT *
FROM `service_categories`
ORDER BY `name` ASC
---
    public function getAllCategories(): array
    {
        return $this->orderBy('name', 'ASC')->findAll();