app/Models/ServiceModel.php

    public function getHomepageServices(int $limit = 12): array
    {
        // For now, we get the first 12. Later, this could be
        // modified to get the most popular or featured services.
        return $this->orderBy('id', 'ASC')->findAll($limit);
---
SELECT *
FROM `services`
ORDER BY `id` ASC
 LIMIT 7